# Assignment 1.7
**intro to pandas**

## Question 1

Question: Select all numeric columns except float from the DataFrame dft.

Answer:

In [1]:
import numpy as np
import pandas as pd

In [2]:
# taken from pands_lesson.ipynb
dft = pd.DataFrame(
    {
        "A": np.random.rand(3), 
        "B": 1, 
        "C": "foo", 
        "D": pd.Timestamp("20010102"), 
        "E": pd.Series([1.0] * 3).astype("float32"), 
        "F": False, 
        "G": pd.Series([1] * 3, dtype="int8")})

dft

          A  B    C          D    E      F  G
0  0.105536  1  foo 2001-01-02  1.0  False  1
1  0.392732  1  foo 2001-01-02  1.0  False  1
2  0.226496  1  foo 2001-01-02  1.0  False  1

In [3]:
dft.select_dtypes(include=['number'], exclude=['float'])

   B  G
0  1  1
1  1  1
2  1  1

## Question 2

Question: How do you return the last 3 rows of a DataFrame df?

Answer:

In [4]:
# taken from pandas_lesson.ipynb
# extend arrays to 6 so can see last 3 rows to check if correct
dft = pd.DataFrame(
    {
        "A": np.random.rand(6), 
        "B": 1, 
        "C": "foo", 
        "D": pd.Timestamp("20010102"), 
        "E": pd.Series([1.0] * 6).astype("float32"), 
        "F": False, 
        "G": pd.Series([1] * 6, dtype="int8")})

dft

          A  B    C          D    E      F  G
0  0.852555  1  foo 2001-01-02  1.0  False  1
1  0.719703  1  foo 2001-01-02  1.0  False  1
2  0.603954  1  foo 2001-01-02  1.0  False  1
3  0.348843  1  foo 2001-01-02  1.0  False  1
4  0.659776  1  foo 2001-01-02  1.0  False  1
5  0.961878  1  foo 2001-01-02  1.0  False  1

In [5]:
dft.tail(3)

          A  B    C          D    E      F  G
3  0.348843  1  foo 2001-01-02  1.0  False  1
4  0.659776  1  foo 2001-01-02  1.0  False  1
5  0.961878  1  foo 2001-01-02  1.0  False  1

## Question 3

Question: Return the minimum and maximum of a Series x as a new Series with the index ["min", "max"].

Answer:

In [6]:
# taken from pandas_lesson.ipynb
obj = pd.Series([5, 6, -3, 2])
x = obj
x

0    5
1    6
2   -3
3    2
dtype: int64

In [7]:
pd.Series([x.min(), x.max()], index=["min","max"])

min   -3
max    6
dtype: int64

## Question 4

Question: Multiply df1 and df2 (two DataFrames) with a fill_value of 1.

Answer:

In [8]:
# taken from pandas_lesson.ipynb
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list("abcde"))

In [9]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [10]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [11]:
df1.multiply(df2, fill_value=1)

      a     b      c      d     e
0   0.0   1.0    4.0    9.0   4.0
1  20.0  30.0   42.0   56.0   9.0
2  80.0  99.0  120.0  143.0  14.0
3  15.0  16.0   17.0   18.0  19.0

## Question 5

Question: How do you create a DataFrame from a nested dictionary of dictionaries?

In [12]:
nested_dict = {'A': {'a': 1, 'b': 2}, 'B': {'a': 3, 'b': 4}}

In [13]:
df = pd.DataFrame(nested_dict)
df

   A  B
a  1  3
b  2  4